{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true,
    "pycharm": {
     "is_executing": true
    }
   },
   "source": [
    "# Лабораторная циклы и условия\n",
    "\n",
    "<p>Задача 1. Составьте программу, выводящую на экран квадраты чисел от 10 до 20 включительно.</p>\n",
    "\n",
    "<hr>\n",
    "\n",
    "<p>Для решения задачи нам понадобится цикл, работающий в промежутке <code>[10;20]</code>. Для построения промежутков нам понадобится функция <code>range()</code>, которой мы передадим границы промежутка чисел.</p>\n",
    "\n",
    "<p>Квадрат числа - это число, умноженное само на себя или возведенное во вторую степень.</p>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "100, 121, 144, 169, 196, 225, 256, 289, 324, 361, 400, "
     ]
    }
   ],
   "source": [
    "for number in range(10, 21):\n",
    "    print(number ** 2, end=', ')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<p><code>range(10, 21)</code> - функция выводит последовательность от и до. Но ДО значит, что число остановки не будет взято в промежуток. Поэтому мы указываем точку остановки как <code>21</code>. Каждое число из промежутка <code>range(10, 21)</code> в цикле возводится в степень <code>2</code>. Так как мы получили числа <code>10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20</code>, мы может больше ничего не предпринимать.</p>\n",
    "\n",
    "<p>Необязательный параметр <code>end</code> функции <code>print()</code> отвечает за то, чем будет заканчиваться вывод строки. По умолчанию там стоит символ новой строчки <code>\\n</code>. Если написать свои значения, то каждый принт будет заканчиваться вашим значением:</p>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5\n",
      "7\n",
      "5 😇 8\n"
     ]
    }
   ],
   "source": [
    "print(5)\n",
    "print(7)\n",
    "\n",
    "print(5, end=' 😇 ')  # этот заканчивается эмоджиком\n",
    "print(8)  # этот вывод заканчивается символом новой строки"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<hr>\n",
    "<p>Задача 2. Даны натуральные числа от 35 до 87. Вывести те из них, которые при делении на 7 дают остаток 1, 2 или 5.</p>\n",
    "\n",
    "<p>Равно как и в проошлой задаче мне понадобится цикл, который будет работать в числовом промежутке <code>[35;87]</code>. Для этого, как и в прошлый раз, мне нужна функция <code>range()</code>, которой я передам старт и стоп промежутка.</p>\n",
    "\n",
    "<p>Внутри цикла мне понадобится поставить условие, которое будет проверять остатки от деления чисел на 7. И здесть есть два варианта: можно написать большое условие с несколькими проверками или поставить оператор <code>in</code>, который проверяет наличие элемента в коллекции.</p>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "36, 37, 40, 43, 44, 47, 50, 51, 54, 57, 58, 61, 64, 65, 68, 71, 72, 75, 78, 79, 82, 85, 86, "
     ]
    }
   ],
   "source": [
    "for number in range(35, 88):\n",
    "    if (number % 7) in [1, 2, 5]:\n",
    "        print(number, end=', ')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<p><code>if (number % 7) in [1, 2, 5]:</code> - мы сначала делим число из диапазона <code>range(35, 88)</code> на 7, возвращаем остаток от деления (<code>%</code>) и провоеряем здесь же, находится ли число-остаток от деления в списке чисел 1, 2 и 5. И если оно там есть, то мы выводим это число.</p>\n",
    "\n",
    "<hr>\n",
    "\n",
    "<p>Задача 3. Найдите сумму  <code>1+2+3+…+n</code>, где число <code>n</code> вводится пользователем с клавиатуры.</p>\n",
    "\n",
    "<p>Как и любые задачи на сумму, эта будет решаться через 2 переменную. К которой я буду прибавлять с присваиванием (<code>+=</code>) каждое число из списка чисел.</p>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "введите число: 5\n",
      "15\n"
     ]
    }
   ],
   "source": [
    "n = int(input('введите число: '))\n",
    "summa = 0\n",
    "\n",
    "for number in range(1, n + 1):\n",
    "    summa += number\n",
    "    \n",
    "print(summa)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<p>Задача 5. Найдите количество четных цифр данного натурального трехзначного числа.</p>\n",
    "\n",
    "<p>Это единственная задача, имеющая два принципиально разных решения. Решение №1 - это разделить число на разряды и проверить каждый из разрядов на четность. Затем посчитать их и вывести сумму:</p>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите трехзначное число: 563\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "n = int(input('Введите трехзначное число: '))\n",
    "\n",
    "slices = [n // 100, n % 100 // 10, n % 10]  # здесь храню разряды чисел\n",
    "\n",
    "counter = 0  # переменная-счетчик \n",
    "\n",
    "for number in slices:  # каждый разряд\n",
    "    if number % 2 == 0:  # разделить на два и проверить остаток \n",
    "        counter += 1  # если остатка нет, то посчитать это число как четное\n",
    "        \n",
    "print(counter)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<p>то, что касается операций, которые позволяют достать разряд из числа.</p>\n",
    "\n",
    "<p>Если разделить любое трехзначное число на 100, получится достать сотни. Но делить надо целочисленно: <code>256 / 100 = 2.56</code>, <code>256 // 100 = 2</code></p>\n",
    "\n",
    "<p>Если вернуть остаток от деления любого трехзначного числа на 100, получится достать десятки и единицы (одновременно). <code>256 % 100 = 56</code>. Если полученное значение целочисленно разделить на 10, получится достать десятки отдельно <code>56 // 10 = 5</code>. </p>\n",
    "\n",
    "<p>Если разделить любое трехзначное число на 10 и вернуть остаток от деления, получится достать единицы <code>256 % 10 = 6</code>.</p>\n",
    "\n",
    "<hr>\n",
    "\n",
    "### Вариант решения №2\n",
    "\n",
    "<p>программа может так делать не только с трехзначными числами, если вы возьмете число как строчку, а не как число. А затем каждую цифру числа будете преобразовывать в тип данных <code>int</code></p>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите число: 456\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "number = input('Введите число: ') # этот инпут вернут строчку \n",
    "counter = 0\n",
    "\n",
    "for integer in number:\n",
    "    if int(integer) % 2 == 0:\n",
    "        counter += 1\n",
    "        \n",
    "print(counter)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 1
}