"""Task 1. Сумма трех чисел.
Нужно написать программу, которая
получает от пользователя три числа
и находит их сумму"""

a = int(input('Введите число: '))
b = int(input('Введите число: '))
c = int(input('Введите число: '))

print(f'{a} + {b} + {c} = {a + b + c}')


